diplom-src/src/Documents/ВКМ_УвольнениеСотрудников/ВКМ_УвольнениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_УвольнениеСотрудников</name>
  <registerRecords>InformationRegister.ВКМ_ПринятыеУволенныеСотрудники</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/InformationRegisters/ВКМ_ПринятыеУволенныеСотрудники/ВКМ_ПринятыеУволенныеСотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ПринятыеУволенныеСотрудники</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПринятУволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/Documents/ВКМ_УвольнениеСотрудников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ПринятыеУволенныеСотрудники.Записывать = Истина;

	
	Для Каждого СтрокаСотрудники Из Сотрудники Цикл
		
		СтатусСотрудника = ВКМ_РасчетыИНачисления.ПроверкаСтатусаСотрудника(СтрокаСотрудники.Сотрудник, Дата);
		Если СтатусСотрудника Тогда
			Движение = Движения.ВКМ_ПринятыеУволенныеСотрудники.Добавить();
			Движение.Сотрудник = СтрокаСотрудники.Сотрудник;
			Движение.ПринятУволен = Ложь;
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
		
		КонецЕсли;
				
		
	КонецЦикла;

	
КонецПроцедуры

#КонецОбласти



#КонецЕсли
